{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/hello-world-2021083117.html"},{"title":"How to install let&#39;s encrypt (certbot) on RHEL&#x2F;CentOS 8","text":"Prerequisites RHEL 8 is installed. The host is subscribed to the Red Hat Customer Portal. dnf tool installed. have sudo access to run privileged commands. have a running Apache web server or Nginx web server. have a domain name. Procedure (Choice 1 or 2) Update your system and install on Nginx Server 12345sudo dnf update -ysudo dnf install https://dl.fedoraproject.org/pub/epel/epel-release-latest-8.noarch.rpmsudo dnf config-manager --set-enabled PowerToolssudo dnf install certbot python3-certbot-nginxsudo certbot certonly --nginx Update your system and install on Apache Server 12345sudo dnf update -ysudo dnf install https://dl.fedoraproject.org/pub/epel/epel-release-latest-8.noarch.rpmsudo dnf config-manager --set-enabled PowerToolssudo dnf install certbot python3-certbot-apachesudo certbot certonly --apache Verification Check certbot version 1certbot --version List All Certificates 1sudo certbot certificates Renew Certificate Manual 1sudo certbot renew Automatic 1sudo echo &quot;0 0,12 * * * root python3 -c 'import random; import time; time.sleep(random.random() * 3600)' &amp;&amp; certbot renew -q&quot; | sudo tee -a /etc/crontab &gt; /dev/null The following content is taken from Certbot documentation with minor revisions.","link":"/how-to-install-lets-encrypt-certbot-rhel-centos-8-2021083119.html"}],"tags":[{"name":"SSL","slug":"SSL","link":"/tags/SSL/"},{"name":"TLS","slug":"TLS","link":"/tags/TLS/"},{"name":"Let&#39;s Encrypt","slug":"Let-s-Encrypt","link":"/tags/Let-s-Encrypt/"},{"name":"certbot","slug":"certbot","link":"/tags/certbot/"}],"categories":[{"name":"SSL&#x2F;TLS","slug":"SSL-TLS","link":"/categories/SSL-TLS/"}]}